app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'sree' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def show
    id=params[:id]

    if id.to_i==0
      @user=User.find_by_username(id)
    else
      @user = User.find(params[:id])

INSERT INTO "users" ("access_token", "bio", "created_at", "fb_id", "gender", "hometown_name", "location_name", "name", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    @user.bio=bio

    respond_to do |format|
      if @user.save